Revit 2025 API
FabricLocation Enumeration
 Fabric location in the host
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricLocation
Public Enumeration FabricLocation
public enum class FabricLocation
type FabricLocation
Members
Member name | Value | Description
TopOrExternal | 0 |  The fabric is on the top face of a floor host, or on the external face of a wall host.
BottomOrInternal | 1 |  The fabric is on the bottom face of a floor host, or on the internal face of a wall host.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace